<template>
  <div class="wrapper wrapper_paddings">
    <div class="register-block">

      <h1 class="text text_h2">Государственный реестр ФИС ФРДО</h1>

      <h2 class="text text_h4 text_mt40">С 01 января 2019 года сведения о выданных удостоверениях о повышении
        квалификации, дипломах
        о профессиональной переподготовке и документов о профессиональном обучении должны размещаться
        в государственном реестре ФИС ФРДО.
      </h2>

      <div class="text text_normal text_mt40">
        <p>
          Федеральная информационная система «Федеральный реестр сведений о документах об образовании и (или) о
          квалификации, документах об обучении» осуществляет формирование и ведение Федерального реестра сведений о
          документах об образовании и (или) о квалификации, документах об обучении.
        </p>
        <br/>
        <p>
          Лицензированные учебные центры обязаны передавать в ФРДО данные о слушателях, которые получили дополнительное
          профессиональное образование (ч. 9 и 10 ст. 98, п. 2 ч. 15 ст. 107 Федерального закона от 29.12.2012 № 273-ФЗ
          «Об
          образовании в Российской Федерации», Постановление Правительства РФ от 26.08.2013 № 729).
        </p>
        <br/>
        <p>
          К дополнительному профессиональному образованию относят курсы повышения квалификации и профпереподготовки.
        </p>
      </div>

      <div class="text text_normal text_mt40">
        <b>ООО «Гарант Сервис Университет» подключен к
          <span class="text_dark-blue">Федеральной государственной информационной системе ФИС ФРДО.</span>
        </b>
        <p>Данные о выданном дипломе удостоверении заносятся в эту систему в течении 60 дней после его выдачи.</p>
      </div>

    </div>
  </div>
</template>

<script>
export default {
  name: "AboutRegister"
}
</script>

<style lang="less" scoped>
@import "assets/core.less";

.register-block {
  margin-top: 45px;
  margin-bottom: 60px;

  @media @min760 {
    margin-top: 90px;
    margin-bottom: 120px;
  }
}

.text_mt40 {
  margin-top: 40px;
}

.text_mt60 {
  margin-top: 60px;
}

.text_dark-blue {
  color: @DarkBlueColor;
}
</style>
